core/app/Http/Controllers/SiteController.php

    public function investmentUsingBalannce(Request $request)
    {

        $request->validate([
            'amount' => 'required|numeric'
        ]);

        $general = GeneralSetting::first();

        $plan_id = Plan::with('time')->findOrFail($request->plan_id);
---
select * from `general_settings` limit 1
select * from `plans` where `plans`.`id` = '15' limit 1
select * from `times` where `times`.`id` in (5)

        }

        $user->balance = $user->balance - $request->amount;
        $user->save();
---
update `users` set `balance` = 204, `users`.`updated_at` = '2024-04-26 17:03:41' where `id` = 2




        Transaction::create([
            'trx' => $deposit->transaction_id,
            'gateway_id' => $deposit->gateway_id,
            'amount' => $deposit->final_amount,
            'currency' => @$general->site_currency,
            'details' => 'Payment Successfull',
            'charge' => 0,
            'type' => '-',
            'gateway_transaction' => '',
            'user_id' => auth()->id(),
            'payment_status' => 1,
        ]);
---
insert into `transactions` (`trx`, `gateway_id`, `amount`, `currency`, `details`, `charge`, `type`, `gateway_transaction`, `user_id`, `payment_status`, `updated_at`, `created_at`) values ('7RIKKD3DBUHX193W', 0, '100', 'USD', 'Payment Successfull', 0, '-', '', 2, 1, '2024-04-26 17:03:43', '2024-04-26 17:03:43')

    public function investLog(Request $request)
    {
        $pageTitle = 'Invest Log';

        $transactions = Payment::when($request->trx, function ($item) use ($request) {
            $item->where('transaction_id', $request->trx);
        })->when($request->date, function ($item) use ($request) {
            $item->whereDate('created_at', $request->date);
        })->where('user_id', auth()->id())->where('payment_status', 1)->paginate();
---
select * from `payments` where `user_id` = 1 and `payment_status` = 1 limit 15 offset 0
select count(*) as aggregate from `payments` where `user_id` = 1 and `payment_status` = 1