core/app/Http/Controllers/UserController.php

    public function dashboard()
    {


        $pageTitle = "Dashboard";
        $totalInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->sum('amount');
        $currentInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->latest()->first('amount');
        $currentPlan = Payment::with('plan')->where('user_id', Auth::id())->where('payment_status', 1)->latest()->first();
        $allPlan = Payment::with('plan')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'plan');
        $withdraw = Withdraw::where('user_id', Auth::id())->where('status', 1)->sum('withdraw_amount');
        $interestLogs = UserInterest::with('payment')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'log');

        $commison = RefferedCommission::where('reffered_by', Auth::id())->sum('amount');

        $pendingInvest = Payment::where('user_id', Auth::id())->where('payment_status', 2)->sum('amount');
        $pendingWithdraw = Withdraw::where('user_id', Auth::id())->where('status', 0)->sum('withdraw_amount');
        $totalDeposit = Deposit::where('user_id', Auth::id())->where('payment_status', 1)->sum('final_amount');

        $referred_users = Db::table('users')
            ->select('id')
            ->where('reffered_by', Auth::id())
            ->pluck('id')
            ->toArray(); // Get the IDs as an array

        $check_ids_deposit = DB::table('deposits')
            ->selectRaw('SUM(amount) AS total_amount')
            ->whereIn('user_id', $referred_users)
            ->first();

        $totalAmount = $check_ids_deposit->total_amount ?? 0;
        $general = GeneralSetting::first();

        if ($totalAmount >= $general->vip5_amount) {
            $user = User::find(Auth::id());
            $user->vip_status = 5;
            if ($general->is_vip_reward == 1) {
                $user->balance += $general->vip5_reward_amount;
                Transaction::create([
                    'trx' => strtoupper(Str::random(16)),
                    'gateway_id' => 0,
                    'amount' => $general->vip5_reward_amount,
                    'currency' => @$general->site_currency,
                    'charge' => 0,
                    'details' => 'Vip Upgradation Bonus',
                    'type' => '+',
                    'gateway_transaction' => '',
                    'user_id' => $user->id,
                ]);
            }
            $user->save();
---
select `amount` from `payments` where `user_id` = 1 and `payment_status` = 1 order by `created_at` desc limit 1
select sum(`amount`) as aggregate from `payments` where `user_id` = 4 and `payment_status` = 1
select `amount` from `payments` where `user_id` = 4 and `payment_status` = 1 order by `created_at` desc limit 1
select * from `payments` where `user_id` = 4 and `payment_status` = 1 order by `created_at` desc limit 1
select * from `plans` where `plans`.`id` in (15)
select * from `payments` where `user_id` = 4 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `payments` where `user_id` = 4
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 4 and `status` = 1
select * from `payments` where `payments`.`id` in (1, 32, 33, 34, 35, 36)
select * from `user_interests` where `user_id` = 4 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `user_interests` where `user_id` = 4
select sum(`amount`) as aggregate from `reffered_commissions` where `reffered_by` = 4
select sum(`amount`) as aggregate from `payments` where `user_id` = 4 and `payment_status` = 2
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 4 and `status` = 0
select sum(`final_amount`) as aggregate from `deposits` where `user_id` = 4 and `payment_status` = 1
select `id` from `users` where `reffered_by` = 4
select SUM(amount) AS total_amount from `deposits` where `user_id` in (2, 3, 4) limit 1
select * from `general_settings` limit 1
select * from `users` where `users`.`id` = 1 limit 1
insert into `transactions` (`trx`, `gateway_id`, `amount`, `currency`, `charge`, `details`, `type`, `gateway_transaction`, `user_id`, `updated_at`, `created_at`) values ('XQLJUYK1TTZZNQ4Y', 0, '500', 'USD', 0, 'Vip Upgradation Bonus', '+', '', 1, '2024-05-01 10:58:53', '2024-05-01 10:58:53')
update `users` set `balance` = 38900, `users`.`updated_at` = '2024-05-01 10:58:53' where `id` = 1

            }
            $user->save();
        } else {
            $user = User::find(Auth::id());
            $user->vip_status = 0;
            $user->save();
        }
        $plans = Plan::where('status' , 1)->get();
---
select * from `users` where `users`.`id` = 4 limit 1
select * from `plans` where `status` = 1

    public function returnInterest()
    {
        $general = GeneralSetting::first();
        $invests = Payment::with('plan', 'user')->where('payment_status', 1)->latest()->get();
---
select * from `general_settings` limit 1
select * from `payments` where `payment_status` = 1 order by `created_at` desc
select * from `plans` where `plans`.`id` in (13, 14, 15)
select * from `users` where `users`.`id` in (1, 2, 4, 5, 6)

                            $checkuplainerlvl1 = (int) DB::table('users')
                            ->where('id', auth()->id())
                            ->value('reffered_by');
                        $checkuplainerlvl2 = (int) DB::table('users')
                            ->where('id', $checkuplainerlvl1)
                            ->value('reffered_by');
                        $checkuplainerlvl3 = (int) DB::table('users')
                            ->where('id', $checkuplainerlvl2)
                            ->value('reffered_by');
                        $checkuplainerlvl4 = (int) DB::table('users')
                            ->where('id', $checkuplainerlvl3)
                            ->value('reffered_by');
                        $checkuplainerlvl5 = (int) DB::table('users')
                            ->where('id', $checkuplainerlvl4)
                            ->value('reffered_by');
                        if ($checkuplainerlvl1 != 0 && $general->ic_lvl_one !=0) {
                            $general_percentage = $general->ic_lvl_one;
                            $PercentAmount = $interestAmount * ($general_percentage / 100);
                            $chkuser = User::find($checkuplainerlvl1);
                            $chkuser->balance += $PercentAmount;
                            $chkuser->save();
                            Transaction::create([
                                'trx' => strtoupper(Str::random(16)),
                                'gateway_id' => 0,
                                'amount' =>  $PercentAmount,
                                'currency' => @$general->site_currency,
                                'charge' => 0,
                                'details' => 'Refferal Invest Commission',
                                'type' => '+',
                                'gateway_transaction' => '',
                                'payment_status' => 1,
                                'user_id' => $chkuser->id,
                            ]);
---
select `reffered_by` from `users` where `id` = 4 limit 1
select `reffered_by` from `users` where `id` = 3 limit 1
select `reffered_by` from `users` where `id` = 2 limit 1
select `reffered_by` from `users` where `id` = 1 limit 1
select * from `users` where `users`.`id` = 3 limit 1
update `users` set `balance` = 103.056, `users`.`updated_at` = '2024-05-07 09:33:54' where `id` = 3
insert into `transactions` (`trx`, `gateway_id`, `amount`, `currency`, `charge`, `details`, `type`, `gateway_transaction`, `user_id`, `updated_at`, `created_at`) values ('QJE5VD2LRZDCAYW6', 0, 0.184, 'USD', 0, 'Refferal Invest Commission', '+', '', 3, '2024-05-07 09:33:54', '2024-05-07 09:33:54')

                        if ($checkuplainerlvl2 != 0 && $general->ic_lvl_two !=0) {
                            $general_percentage = $general->ic_lvl_two;
                            $PercentAmount = $interestAmount * ($general_percentage / 100);
                            $chkuser = User::find($checkuplainerlvl2);
                            $chkuser->balance += $PercentAmount;
                            $chkuser->save();
---
select * from `users` where `users`.`id` = 2 limit 1
update `users` set `balance` = 51.344, `users`.`updated_at` = '2024-05-07 09:33:54' where `id` = 2

                        if ($checkuplainerlvl3 != 0 && $general->ic_lvl_three !=0) {
                            $general_percentage = $general->ic_lvl_three;
                            $PercentAmount = $interestAmount * ($general_percentage / 100);
                            $chkuser = User::find($checkuplainerlvl3);
                            $chkuser->balance += $PercentAmount;
                            $chkuser->save();
---
select * from `users` where `users`.`id` = 1 limit 1
update `users` set `balance` = 51.436, `users`.`updated_at` = '2024-05-07 09:33:54' where `id` = 1

                        }

                        //paymentupdate on next date
                        $updatePayment = Payment::where('plan_id', $invest->plan_id)->where('next_payment_date', $invest->next_payment_date)->first();

                        $count = Payment::where('plan_id', $invest->plan_id)->where('next_payment_date', $invest->next_payment_date)->sum('pay_count');
---
select * from `payments` where `plan_id` = 15 and `next_payment_date` = '2024-05-04 13:26:55' limit 1
select sum(`pay_count`) as aggregate from `payments` where `plan_id` = 15 and `next_payment_date` = '2024-05-04 13:26:55'

                                $updatePayment->interest_amount += $interestAmount;
                                $updatePayment->pay_count += 1;

                                UserInterest::create([
                                    'user_id' => $user->id,
                                    'payment_id' => $invest->id,
                                    'interest_amount' => $interestAmount,
                                    'purpouse' => 'Invest Return Commission'
                                ]);
---
insert into `user_interests` (`user_id`, `payment_id`, `interest_amount`, `purpouse`, `updated_at`, `created_at`) values (4, 36, 1.84, 'Invest Return Commission', '2024-05-07 09:33:54', '2024-05-07 09:33:54')

                                    'currency' => @$general->site_currency
                                ], $invest->user);

                                $updatePayment->save();
                                $user->save();
---
update `payments` set `next_payment_date` = '2024-05-05 13:26:55', `interest_amount` = 7.35999998, `pay_count` = 4, `payments`.`updated_at` = '2024-05-07 09:33:56' where `id` = 36
update `users` set `balance` = 409.68, `users`.`updated_at` = '2024-05-07 09:33:56' where `id` = 4

    public function transactionLog(Request $request)
    {
        $pageTitle = 'Transaction Log';

        $transactions = Transaction::when($request->trx, function ($item) use ($request) {
            $item->where('trx', $request->trx);
        })->when($request->date, function ($item) use ($request) {
            $item->whereDate('created_at', $request->date);
        })->where('user_id', auth()->id())->where('payment_status', 1)->latest()->paginate();
---
select * from `transactions` where `user_id` = 1 and `payment_status` = 1 order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `transactions` where `user_id` = 1 and `payment_status` = 1