app/Http/Controllers/UserController.php

    public function dashboard()
    {


        $pageTitle = "Dashboard";
        $totalInvest = Payment::where('user_id', Auth::id())->where('payment_status', 1)->sum('amount');
        $currentInvest = Payment::where('user_id', Auth::id())
            ->where('payment_status', 1)
            ->where(
                'next_payment_date',
                '>=',
                now()
            )
            ->latest()
            ->first('amount');
        $currentPlan = Payment::with('plan')->where('user_id', Auth::id())->where('payment_status', 1)->latest()->first();
        $allPlan = Payment::with('plan')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'plan');
        $withdraw = Withdraw::where('user_id', Auth::id())->where('status', 1)->sum('withdraw_amount');
        $interestLogs = UserInterest::with('payment')->where('user_id', Auth::id())->latest()->paginate(10, ['*'], 'log');

        $commison = RefferedCommission::where('reffered_by', Auth::id())->sum('amount');
        $currentDayCommision = RefferedCommission::where('reffered_by', Auth::id())->latest()->first('amount');
        $pendingInvest = Payment::where('user_id', Auth::id())->where('payment_status', 2)->sum('amount');
        $pendingWithdraw = Withdraw::where('user_id', Auth::id())->where('status', 0)->sum('withdraw_amount');
        $totalDeposit = Deposit::where('user_id', Auth::id())->where('payment_status', 1)->sum('final_amount');



        // perfomane chart work
        $LvlOneUsers = Db::table('users')
            ->select('id')
            ->where('reffered_by', Auth::id())
            ->where('status', 1) // Add this line
            ->pluck('id')
            ->toArray();


        $SumLvlOneDepositAmnt = DB::table('deposits')
            ->selectRaw('SUM(amount) AS total_amount')
            ->whereIn('user_id', $LvlOneUsers)
            ->where('payment_status', 1)
            ->first();

        $LvlTwoUsers = DB::table('users')
            ->select('id')
            ->whereIn('reffered_by', $LvlOneUsers)
            ->where('status', 1)
            ->pluck('id')
            ->toArray();

        $SumLvlTwoDepositAmnt = DB::table('deposits')
            ->selectRaw('SUM(amount) AS total_amount')
            ->whereIn('user_id', $LvlTwoUsers)
            ->where('payment_status', 1)
            ->first();

        $LvlThreeUsers = DB::table('users')
            ->select('id')
            ->whereIn('reffered_by', $LvlTwoUsers)
            ->where('status', 1)
            ->pluck('id')
            ->toArray();
---
select sum(`amount`) as aggregate from `payments` where `user_id` = 1 and `payment_status` = 1
select `amount` from `payments` where `user_id` = 1 and `payment_status` = 1 order by `created_at` desc limit 1
select sum(`amount`) as aggregate from `payments` where `user_id` = 1 and `payment_status` = 2
select count(*) as aggregate from `payments` where `user_id` = 1
select sum(`withdraw_amount`) as aggregate from `withdraws` where `user_id` = 1 and `status` = 0
select count(*) as aggregate from `user_interests` where `user_id` = 1
select sum(`amount`) as aggregate from `reffered_commissions` where `reffered_by` = 1
select `amount` from `reffered_commissions` where `reffered_by` = 1 order by `created_at` desc limit 1
select sum(`final_amount`) as aggregate from `deposits` where `user_id` = 1 and `payment_status` = 1
select `id` from `users` where `reffered_by` = 1 and `status` = 1
select SUM(amount) AS total_amount from `deposits` where `user_id` in (2, 3, 4, 5, 6, 14) and `payment_status` = 1 limit 1
select `id` from `users` where `reffered_by` in (2, 3, 4, 5, 6, 14) and `status` = 1
select SUM(amount) AS total_amount from `deposits` where `user_id` in (15, 16) and `payment_status` = 1 limit 1
select `id` from `users` where `reffered_by` in (15, 16) and `status` = 1

            ->first();


        $SumLvlOneComAmnt = DB::table('reffered_commissions')
            ->selectRaw('SUM(amount) AS total_com')
            ->whereIn('reffered_to', $LvlOneUsers)
            ->first();
---
select SUM(amount) AS total_com from `reffered_commissions` where `reffered_to` in (15, 16) limit 1

        // perfomane chart work

        // vip work
        $user = User::find(Auth::id());
        $general = GeneralSetting::first();
---
select * from `users` where `users`.`id` = 1 limit 1
select * from `general_settings` limit 1



        // vip work
        $plans = Plan::where('status', 1)->get();
---
select * from `plans` where `status` = 1

    public function team()
    {
        $LvlOneUsers = Db::table('users')
            ->select('id')
            ->where('reffered_by', Auth::id())
            ->where('status', 1) // Add this line
            ->pluck('id')
            ->toArray();


        $SumLvlOneDepositAmnt = DB::table('deposits')
            ->selectRaw('SUM(amount) AS total_amount')
            ->whereIn('user_id', $LvlOneUsers)
            ->where('payment_status', 1)
            ->first();

        $LvlTwoUsers = DB::table('users')
            ->select('id')
            ->whereIn('reffered_by', $LvlOneUsers)
            ->where('status', 1)
            ->pluck('id')
            ->toArray();

        $SumLvlTwoDepositAmnt = DB::table('deposits')
            ->selectRaw('SUM(amount) AS total_amount')
            ->whereIn('user_id', $LvlTwoUsers)
            ->where('payment_status', 1)
            ->first();
---
select `id` from `users` where `reffered_by` = 1 and `status` = 1
select `id` from `users` where `reffered_by` in (5, 6, 14) and `status` = 1
select SUM(amount) AS total_amount from `deposits` where `user_id` in (2, 3, 4, 18) and `payment_status` = 1 limit 1

            ->pluck('id')
            ->toArray();

        $SumLvlThreeDepositAmnt = DB::table('deposits')
            ->selectRaw('SUM(amount) AS total_amount')
            ->whereIn('user_id', $LvlThreeUsers)
            ->where('payment_status', 1)
            ->first();
---
select SUM(amount) AS total_amount from `deposits` where `user_id` in (5, 6, 14) and `payment_status` = 1 limit 1

            ->selectRaw('SUM(amount) AS total_com')
            ->whereIn('reffered_to', $LvlOneUsers)
            ->first();
        $SumLvlTwoComAmnt = DB::table('reffered_commissions')
            ->selectRaw('SUM(amount) AS total_com')
            ->whereIn('reffered_to', $LvlTwoUsers)
            ->first();
        $SumLvlThreeComAmnt = DB::table('reffered_commissions')
            ->selectRaw('SUM(amount) AS total_com')
            ->whereIn('reffered_to', $LvlThreeUsers)
            ->first();
---
select SUM(amount) AS total_com from `reffered_commissions` where `reffered_to` in (2, 3, 4, 18) limit 1
select SUM(amount) AS total_com from `reffered_commissions` where `reffered_to` in (5, 6, 14) limit 1