app/Http/Controllers/UserController.php

select * from `reffered_commissions` where `reffered_by` = 2 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `reffered_commissions` where `reffered_by` = 2
---
    public function commision(Request $request)
    {

        $pageTitle = 'Complete withdraw';

        $commison = RefferedCommission::when($request->date, function ($item) use ($request) {
            $item->whereDate('created_at', $request->date);
        })->where('reffered_by', Auth::id())->latest()->paginate(10, ['*'], 'commison');