app/Http/Controllers/Admin/ManageGatewayController.php

select * from `users` where `users`.`id` = '' limit 1
select * from `deposits` where `payment_type` = 0 order by `created_at` desc limit 15 offset 0
select * from `users` where `users`.`id` in (2, 3, 4, 6, 14, 16)
select count(*) as aggregate from `deposits` where `payment_type` = 0
---
    public function depositLog($user = '')
    {
        $user = User::find($user);


        $data['pageTitle'] = "Deposit Log";
        $data['navDepositPaymentActiveClass'] = 'active';

        $manuals = Deposit::query();

        if ($user) {
            $manuals->where('user_id', $user->id);
        }

        $data['manuals'] = $manuals->where('payment_type', 0)->with('user')->latest()->paginate();